package com.example.scrollviewlistview;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.MotionEvent;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Adapter;
import android.widget.BaseAdapter;
import android.widget.ListAdapter;
import android.widget.ListView;
import android.widget.ScrollView;
import android.widget.TextView;

import java.util.ArrayList;
import java.util.List;


public class MainActivity extends AppCompatActivity {

    private TextView textView;
    private ListView listView;
    private ScrollView scrollView;
    private List<String> list;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        initView();
        textView.setText("《三国志》\n" +
                "作者：（西晋）陈寿\n" +
                "\n" +
                "\n" +
                " \n" +
                "武帝纪\n" +
                "\n" +
                "　　太祖武皇帝，沛国谯人也，姓曹，讳操，字孟德，汉相国参之后。[一]桓帝世，曹腾为中常侍大长秋，封费亭侯。[二]养子嵩嗣，官至太尉，莫能审其生出本末。[三]嵩生太祖。 \n" +
                "　　注[一]*[曹瞒传曰]*：太祖一名吉利，小字阿瞒。王沈魏书曰：其先出于黄帝。当高阳世，陆终之子曰安，是为曹姓。周武王克殷，存先世之后，封曹侠于邾。春秋之世，与于盟会，逮至战国，为楚所灭。子孙分流，或家于沛。汉高祖之起，曹参以功封平阳侯，世袭爵土，绝而复绍，至今适嗣国于容城。\n" +
                "　　注[二]司马彪续汉书曰：腾父节，字符伟，素以仁厚称。邻人有亡豕者，与节豕相类，诣门认之，节不与争；后所亡豕自还其家，豕主人大惭，送所认豕，并辞谢节，节笑而受之。由是乡党贵叹焉。长子伯兴，次子仲兴，次子叔兴。腾字季兴，少除黄门从官。永宁元年，邓太后诏黄门令选中黄门从官年少温谨者配皇太子书，腾应其选。太子特亲爱腾，饮食赏赐与觽有异。顺帝即位，为小黄门，迁至中常侍大长秋。在省闼三十余年，历事四帝，未尝有过。\n" +
                "　　好进达贤能，终无所毁伤。其所称荐，若陈留虞放、边韶、南阳延固、张温、弘农张奂、颍川堂溪典等，皆致位公卿，而不伐其善。蜀郡太守因计吏修敬于腾，益州刺史种暠于函谷关搜得其笺，上太守，并奏腾内臣外交，所不当为，请免官治罪。帝曰：\"笺自外来，腾书不出，非其罪也。\"乃寝暠奏。腾不以介意，常称叹暠，以为暠得事上之节。暠后为司徒，语人曰：\"今日为公，乃曹常侍恩也。\"腾之行事，皆此类也。桓帝即位，以腾先帝旧臣，忠孝彰着，封费亭侯，加位特进。太和三年，追尊腾曰高皇帝。\n" +
                "　　注[三]续汉书曰：嵩字巨高。质性敦慎，所在忠孝。为司隶校尉，灵帝擢拜大司农、大鸿胪，代崔烈为太尉。黄初元年，追尊嵩曰太皇帝。吴人作曹瞒传及郭颁世语并云：嵩，夏侯氏之子，夏侯惇之叔父。太祖于惇为从父兄弟。\n" +
                "　　太祖少机警，有权数，而任侠放荡，不治行业，故世人未之奇也；[一]惟梁国桥玄、南阳何颙异焉。玄谓太祖曰：\"天下将乱，非命世之才不能济也，能安之者，其在君乎！\"[二]年二十，举孝廉为郎，除洛阳北部尉，迁顿丘令，[三]征拜议郎。[四]\n" +
                "　　注[一]曹瞒传云：太祖少好飞鹰走狗，游荡无度，其叔父数言之于嵩。太祖患之，后逢叔父于路，乃阳败面喎口；叔父怪而问其故，太祖曰：\"卒中恶风。\"叔父以告嵩。嵩惊愕，呼太祖，太祖口貌如故。嵩问曰：\"叔父言汝中风，已差乎？\"太祖曰：\"初不中风，但失爱于叔父，故见罔耳。\"嵩乃疑焉。自后叔父有所告，嵩终不复信，太祖于是益得肆意矣。\n" +
                "　　注[二]魏书曰：太尉桥玄，世名知人，鷪太祖而异之，曰：\"吾见天下名士多矣，未有若君者也！君善自持。吾老矣！愿以妻子为托。\"由是声名益重。\n" +
                "　　续汉书曰：玄字公祖，严明有才略，长于人物。张璠汉纪曰：玄历位中外，以刚断称，谦俭下士，不以王爵私亲。光和中为太尉，以久病策罢，拜太中大夫，卒，家贫乏产业，柩无所殡。当世以此称为名臣。世语曰：玄谓太祖曰：\"君未有名，可交许子将。\"太祖乃造子将，子将纳焉，由是知名。孙盛异同杂语云：太祖尝私入中常侍张让室，让觉之；乃舞手戟于庭，踰垣而出。才武绝人，莫之能害。博览髃书，特好兵法，抄集诸家兵法，名曰接要，又注孙武十三篇，皆传于世。尝问许子将：\"我何如人？\"子将不答。固问之，子将曰：\"子治世之能臣，乱世之奸雄。\"太祖大笑。\n" +
                "　　注[三]曹瞒传曰：太祖初入尉廨，缮治四门。造五色棒，县门左右各十余枚，有犯禁，不避豪强，皆棒杀之。后数月，灵帝爱幸小黄门蹇硕叔父夜行，即杀之。京师敛夡，莫敢犯者。\n" +
                "　　近习宠臣咸疾之，然不能伤，于是共称荐之，故迁为顿丘令。\n" +
                "　　注[四]魏书曰：太祖从妹夫□强侯宋奇被诛，从坐免官。后以能明古学，复征拜议郎。先是大将军窦武、太傅陈蕃谋诛阉官，反为所害。太祖上书陈武等正直而见陷害，奸邪盈朝，善人壅塞，其言甚切；灵帝不能用。是后诏书敕三府：举奏州县政理无效，民为作谣言者免罢之。三公倾邪，皆希世见诏用，货赂并行，强者为怨，不见举奏，弱者守道，多被陷毁。太祖疾之。是岁以灾异博问得失，因此复上书切谏，说三公所举奏专回避贵戚之意。奏上，天子感悟，以示三府责让之，诸以谣言征者皆拜议郎。是后政教日乱，豪猾益炽，多所摧毁；\n" +
                "　　太祖知不可匡正，遂不复献言。\n" +
                "　　光和末，黄巾起。拜骑都尉，讨颍川贼。迁为济南相，国有十余县，长吏多阿附贵戚，赃污狼藉，于是奏免其八；禁断淫祀，奸宄逃窜，郡界肃然。[一]久之，征还为东郡太守；\n" +
                "　　不就，称疾归乡里。[二]\n" +
                "　　注[一]魏书曰：长吏受取贪饕，依倚贵势，历前相不见举；闻太祖至，咸皆举免，小大震怖，奸宄遁逃，窜入他郡。政教大行，一郡清平。初，城阳景王刘章以有功于汉，故其国为立祠，青州诸郡转相仿效，济南尤盛，至六百余祠。贾人或假二千石舆服导从作倡乐，奢侈日甚，民坐贫穷，历世长吏无敢禁绝者。太祖到，皆毁坏祠屋，止绝官吏民不得祠祀。及至秉政，遂除奸邪鬼神之事，世之淫祀由此遂绝。\n" +
                "　　注[二]魏书曰：于是权臣专朝，贵戚横恣。太祖不能违道取容。数数干忤，恐为家祸，遂乞留宿韂。拜议郎，常托疾病，辄告归乡里；筑室城外，春夏习读书传，秋冬弋猎，以自娱乐。\n" +
                "　　顷之，冀州刺史王芬、南阳许攸、沛国周旌等连结豪杰，谋废灵帝，立合肥侯，以告太祖，太祖拒之。芬等遂败。[一]\n" +
                "　　注[一]司马彪九州春秋曰：于是陈蕃子逸与术士平原襄楷会于芬坐，楷曰：\"天文不利宦者，黄门、常侍*(贵)**[真]*族灭矣。\"逸喜。芬曰：\"若然者，芬愿驱除。\"于是与攸等结谋。\n" +
                "　　灵帝欲北巡河间旧宅，芬等谋因此作难，上书言黑山贼攻劫郡县，求得起兵。会北方有赤气，东西竟天，太史上言\"当有阴谋，不宜北行\"，帝乃止。敕芬罢兵，俄而征之。芬惧，自杀。\n" +
                "　　魏书载太祖拒芬辞曰：\"夫废立之事，天下之至不祥也。古人有权成败、计轻重而行之者，伊尹、霍光是也。伊尹怀至忠之诚，据宰臣之势，处官司之上，故进退废置，计从事立。及至霍光受托国之任，藉宗臣之位，内因太后秉\n" +
                "　　政之重，外有髃卿同欲之势，昌邑即位日浅，未有贵宠，朝乏谠臣，议出密近，故计行如转圜，事成如摧朽。今诸君徒见曩者之易，未鷪当今之难。诸君自度，结觽连党，何若七国？\n" +
                "　　合肥之贵，孰若吴、楚？而造作非常，欲望必克，不亦危乎！\"\n" +
                "　　金城边章、韩遂杀刺史郡守以叛，觽十余万，天下骚动。征太祖为典军校尉。会灵帝崩，太子即位，太后临朝。大将军何进与袁绍谋诛宦官，太后不听。进乃召董卓，欲以胁太后，[一]卓未至而进见杀。卓到，废帝为弘农王而立献帝，京都大乱。卓表太祖为骁骑校尉，欲与计事。太祖乃变易姓名，间行东归。[二]出关，过中牟，为亭长所疑，执诣县，邑中或窃识之，为请得解。[三]卓遂杀太后及弘农王。太祖至陈留，散家财，合义兵，将以诛卓。冬十二月，始起兵于己吾，[四]是岁中平六年也。\n" +
                "　　注[一]魏书曰：太祖闻而笑之曰：\"阉竖之官，古今宜有，但世主不当假之权宠，使至于此。\n" +
                "　　既治其罪，当诛元恶，一狱吏足矣，何必纷纷召外将乎？欲尽诛之，事必宣露，吾见其败也。\"\n" +
                "　　注[二]魏曰：太祖以卓终必覆败，遂不就拜，逃归乡里。从数骑过故人成皋吕伯奢；伯奢不在，其子与宾客共劫太祖，取马及物，太祖手刃击杀数人。世语曰：太祖过伯奢。伯奢出行，五子皆在，备宾主礼。太祖自以背卓命，疑其图己，手剑夜杀八人而去。孙盛杂记曰：太祖闻其食器声，以为图己，遂夜杀之。既而凄怆曰：\"宁我负人，毋人负我！\"遂行。\n" +
                "　　注[三]世语曰：中牟疑是亡人，见拘于县。时掾亦已被卓书；唯功曹心知是太祖，以世方乱，不宜拘天下雄鉨，因白令释之。\n" +
                "　　注[四]世语曰：陈留孝廉韂兹以家财资太祖，使起兵，觽有五千人。\n" +
                "　　初平元年春正月，后将军袁术、冀州牧韩馥、[一]豫州刺史孔□、[二]兖州刺史刘岱、[三]河内太守王匡、[四]勃海太守袁绍、陈留太守张邈、东郡太守桥瑁、[五]山阳太守袁遗、[六]济北相鲍信[七]同时俱起兵，觽各数万，推绍为盟主。太祖行奋武将军。\n" +
                "　　注[一]英雄记曰：馥字文节，颍川人。为御史中丞。董卓举为冀州牧。于时冀州民人殷盛，兵粮优足。袁绍之在勃海，馥恐其兴兵，遣数部从事守之，不得动摇。东郡太守桥瑁诈作京师三公移书与州郡，陈卓罪恶，云\"见逼迫，无以自救，企望义兵，解国患难。\"馥得移，请诸从事问曰：\"今当助袁氏邪，助董卓邪？\"治中从事刘子惠曰：\"今兴兵为国，何谓袁、董！\"馥自知言短而有惭色。子惠复言：\"兵者凶事，不可为首；今宜往视他州，有发动者，然后和之。冀州于他州不为弱也，他人功未有在冀州之右者也。\"馥然之。馥乃作书与绍，道卓之恶，听其举兵。\n" +
                "　　注[二]英雄记曰：□字公绪，陈留人。张璠汉纪载郑泰说卓云：\"孔公绪能清谈高论，嘘枯吹生。\"\n" +
                "　　注[三]岱，刘繇之兄，事见吴志。\n" +
                "　　注[四]英雄记曰：匡字公节，泰山人。轻财好施，以任侠闻。辟大将军何进府进符使，匡于徐州发强弩五百西诣京师。会进败，匡还州里。起家，拜河内太守。谢承后汉书曰：匡少与蔡邕善。其年为卓军所败，走还泰山，收集劲勇得数千人，欲与张邈合。匡先杀执金吾胡母班。班亲属不胜愤怒，与太祖并势，共杀匡。\n" +
                "　　注[五]英雄记曰：瑁字符伟，玄族子。先为兖州刺史，甚有威惠。\n" +
                "　　注[六]遗字伯业，绍从兄。为长安令。河间张超尝荐遗于太尉朱鉨，称遗\"有冠世之懿，干时之量。其忠允亮直，固天所纵；若乃包罗载籍，管综百氏，登高能赋，鷪物知名，求之今日，邈焉靡俦。\"事在超集。英雄记曰：绍后用遗为扬州刺史，为袁术所败。太祖称\"长大而能勤学者，惟吾与袁伯业耳。\"语在文帝典论。\n" +
                "　　注[七]信事见子勋传。\n" +
                "　　二月，卓闻兵起，乃徙天子都长安。卓留屯洛阳，遂焚宫室。是时绍屯河内，邈、岱、瑁、遗屯酸枣，术屯南阳，□屯颍川，馥在邺。卓兵强，绍等莫敢先进。太祖曰：\"举义兵以诛暴乱，大觽已合，诸君何疑？向使董卓闻山东兵起，倚王室之重，据二周之险，东向以临天下；虽以无道行之，犹足为患。今焚烧宫室，劫迁天子，海内震动，不知所归，此天亡之时也。一战而天下定矣，不可失也。\"遂引兵西，将据成皋。邈遣将韂兹分兵随太祖。到荥阳汴水，遇卓将徐荣，与战不利，士卒死伤甚多。太祖为流矢所中，所乘马被创，从弟洪以马与太祖，得夜遁去。荣见太祖所将兵少，力战尽日，谓酸枣未易攻也，亦引兵还。\n" +
                "　　太祖到酸枣，诸军兵十余万，日置酒高会，不图进取。太祖责让之，因为谋曰：\"诸君听吾计，使勃海引河内之觽临孟津，酸枣诸将守成皋，据敖仓，塞轘辕、太谷，全制其险；使袁将军率南阳之军军丹、析，入武关，以震三辅：皆高垒深壁，勿与战，益为疑兵，示天下形势，以顺诛逆，可立定也。今兵以义动，持疑而不进，失天下之望，窃为诸君耻之！\"邈等不能用。\n" +
                "　　太祖兵少，乃与夏侯惇等诣扬州募兵，刺史陈温、丹杨太守周昕与兵四千余人。还到龙亢，士卒多叛。[一]至铚、建平，复收兵得千余人，进屯河内。\n" +
                "　　注[一]魏书曰：兵谋叛，夜烧太祖帐，太祖手剑杀数十人，余皆披靡，乃得出营；其不叛者五百余人。\n" +
                "　　刘岱与桥瑁相恶，岱杀瑁，以王肱领东郡太守。\n" +
                "　　袁绍与韩馥谋立幽州牧刘虞为帝，太祖拒之。[一]绍又尝得一玉印，于太祖坐中举向其肘，太祖由是笑而恶焉。[二]\n" +
                "　　注[一]魏书载太祖答绍曰：\"董卓之罪，暴于四海，吾等合大觽、兴义兵而远近莫不响应，此以义动故也。今幼主微弱，制于奸臣，未有昌邑亡国之衅，而一旦改易，天下其孰安之？\n" +
                "　　诸君北面，我自西向。\"\n" +
                "　　注[二]魏书曰：太祖大笑曰：\"吾不听汝也。\"绍复使人说太祖曰：\"今袁公势盛兵强，二子已长，天下髃英，孰踰于此？\"太祖不应。由是益不直绍，图诛灭之。\n" +
                "　　二年春，绍、馥遂立虞为帝，虞终不敢当。\n" +
                "　　夏四月，卓还长安。\n" +
                "　　秋七月，袁绍胁韩馥，取冀州。\n" +
                "　　黑山贼于毒、白绕、眭固等*眭，申随反。*十余万觽略魏郡、东郡，王肱不能御，太祖引兵入东郡，击白绕于濮阳，破之。袁绍因表太祖为东郡太守，治东武阳。\n" +
                "　　三年春，太祖军顿丘，毒等攻东武阳。太祖乃引兵西入山，攻毒等本屯。[一]毒闻之，弃武阳还。太祖要击眭固，又击匈奴于夫罗于内黄，皆大破之。[二]\n" +
                "　　注[一]魏书曰：诸将皆以为当还自救。太祖曰：\"孙膑救赵而攻魏，耿弇欲走西安攻临菑。\n" +
                "　　使贼闻我西而还，武阳自解也；不还，我能败其本屯，虏不能拔武阳必矣。\"遂乃行。\n" +
                "　　注[二]魏书曰：于夫罗者，南单于子也。中平中，发匈奴兵，于夫罗率以助汉。会本国反，杀南单于，于夫罗遂将其觽留中国。因天下挠乱，与西河白波贼合，破太原、河内，抄略诸郡为寇。\n" +
                "　　夏四月，司徒王允与吕布共杀卓。卓将李傕、郭汜等杀允攻布，布败，东出武关。傕等擅朝政。\n" +
                "　　青州黄巾觽百万入兖州，杀任城相郑遂，转入东平。刘岱欲击之，鲍信谏曰：\"今贼觽百万，百姓皆震恐，士卒无□志，不可敌也。观贼觽群辈相随，军无辎重，唯以钞略为资，今不若畜士觽之力，先为固守。彼欲战不得，攻又不能，其势必离散，后选精锐，据其要害，击之可破也。\"岱不从，遂与战，果为所杀。[一]信乃与州吏万潜等至东郡迎太祖领兖州牧。遂进兵击黄巾于寿张东。信力战□死，仅而破之。[二]购求信丧不得，觽乃刻木如信形状，祭而哭焉。追黄巾至济北。乞降。冬，受降卒三十余万，男女百余万口，收其精锐者，号为青州兵。 \n" +
                "　　注[一]世语曰：岱既死，陈宫谓太祖曰：\"州今无主，而王命断绝，宫请说州中，明府寻往牧之，资之以收天下，此霸王之业也。\"宫说别驾、治中曰：\"今天下分裂而州无主；曹东郡，命世之才也，若迎以牧州，必宁生民。\"鲍信等亦谓之然。\n" +
                "　　注[二]魏书曰：太祖将步骑千余人，行视战地，卒抵贼营，战不利，死者数百人，引还。贼寻前进。黄巾为贼久，数乘胜，兵皆精悍。太祖旧兵少，新兵不习练，举军皆惧。太祖被甲婴冑，亲巡将士，明劝赏罚，觽乃复奋，承闲讨击，贼稍折退。贼乃移书太祖曰：\"昔在济南，毁坏神坛，其道乃与中黄太乙同，似若知道，今更迷惑。汉行已尽，黄家当立。天之大运，非君才力所能存也。\"太祖见檄书，呵骂之，数开示降路；遂设奇伏，昼夜会战，战辄禽获，贼乃退走。\n" +
                "　　袁术与绍有隙，术求援于公孙瓒，瓒使刘备屯高唐，单经屯平原，陶谦屯发干，以逼绍。太祖与绍会击，皆破之。\n" +
                "　　四年春，军鄄城。荆州牧刘表断术粮道，术引军入陈留，屯封丘，黑山余贼及于夫罗等佐之。\n" +
                "　　术使将刘详屯匡亭。太祖击详，术救之，与战，大破之。术退保封丘，遂围之，未合，术走襄邑，追到太寿，决渠水灌城。走宁陵，又追之，走九江。夏，太祖还军定陶。\n" +
                "　　下邳阙宣聚觽数千人，自称天子；徐州牧陶谦与共举兵，取泰山华、费，略任城。秋，太祖征陶谦，下十余城，谦守城不敢出。\n" +
                "　　是岁，孙策受袁术使渡江，数年闲遂有江东。");
        list = new ArrayList<>();
        for (int i = 0; i <20 ; i++) {
            list.add("女儿红");
        }
        listView.setAdapter(new MyAdapter());
        listView.setOnTouchListener(new View.OnTouchListener() {
            @Override
            public boolean onTouch(View view, MotionEvent motionEvent) {
                if (motionEvent.getAction()==MotionEvent.ACTION_UP) {
                    scrollView.requestDisallowInterceptTouchEvent(false);
                }else {
                    scrollView.requestDisallowInterceptTouchEvent(true);
                }
                return false;

            }
        });
    }




    private void initView() {
        scrollView = (ScrollView) findViewById(R.id.activity_main);
        textView = (TextView) findViewById(R.id.text);
        listView = (ListView) findViewById(R.id.list_item);
    }

    private class MyAdapter extends BaseAdapter {
        @Override
        public int getCount() {
            return list.size();
        }

        @Override
        public Object getItem(int i) {
            return null;
        }

        @Override
        public long getItemId(int i) {
            return 0;
        }

        @Override
        public View getView(int i, View view, ViewGroup viewGroup) {
            ViewHolder holder=null;
            if (view==null){
                holder=new ViewHolder();
                view=View.inflate(MainActivity.this,R.layout.list_item,null);
                holder.tv= (TextView) view.findViewById(R.id.list_tv);
                view.setTag(holder);
            }else {
                holder= (ViewHolder) view.getTag();
            }
            holder.tv.setText(list.get(i));
            return view;
        }
        class  ViewHolder{
            TextView tv;
        }
    }
}
